from app.models.home import UniversityOverview

faculties_list = [
    "كلية الطب البشرى","كلية طب الأسنان","كلية العلاج الطبيعى","كلية الهندسة",
    "كلية تكنولوجيا العلوم الصحية التطبيقية","كلية الأقتصاد وإدارة الأعمال",
    "كلية علوم الحاسب","كلية الفنون البصرية","كلية الطب البيطرى","كلية علوم الطاقة"
]

university_info = UniversityOverview(
    name="جامعة بنها الأهلية",
    description="جامعة أهلية غير هادفة للربح (...) تضم 10 كليات.",
    image_url="https://bnu.edu.eg/files/26859_1659649382.jpg",
    established="قرار رئيس الجمهورية 369 لسنة 2022",
    faculties=faculties_list,
    programs_count=25,
    campus="مساحة 40 فدان مع مرافق متطورة",
    buildings=[
        "المبنى الإداري","6 مباني أكاديمية","مبنى المعامل المركزية",
        "2 مبنى للورش","منطقة ترفيهية","مسرح","مكتبة شاملة"
    ],
    vision="تعتمد تقنيات التعليم الحديثة وتنافس عالميًا مع الحفاظ على الهوية المصرية."
)
